In [17]:
import numpy as np
# Importing libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Load the data
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset["train"].to_pandas()

# Data cleanup
df["job_posted_date"] = pd.to_datetime(df["job_posted_date"])

Using the latest cached version of the dataset since lukebarousse/data_jobs couldn't be found on the Hugging Face Hub
Found the latest cached dataset configuration 'default' at C:\Users\gabe_\.cache\huggingface\datasets\lukebarousse___data_jobs\default\0.0.0\1d815e9ce232eb27db11939c44eb048fe6d2e9ab (last modified on Thu Aug 22 10:16:47 2024).

In [18]:
df.loc[:, "salary_year_avg":"salary_hour_avg"]

        salary_year_avg  salary_hour_avg
0                   NaN              NaN
1                   NaN              NaN
2                   NaN              NaN
3                   NaN              NaN
4                   NaN              NaN
...                 ...              ...
785736              NaN              NaN
785737              NaN              NaN
785738              NaN              NaN
785739              NaN              NaN
785740              NaN              NaN

[785741 rows x 2 columns]

Fill in the NaN with median values

In [19]:
median_salary = df["salary_year_avg"].median()
median_salary

115000.0

In [20]:
median_hourly = df["salary_hour_avg"].median()
median_hourly

45.97999954223633

In [21]:
df_filled = df

df_filled["salary_year_avg"] = df_filled["salary_year_avg"].fillna(median_salary)
df_filled["salary_hour_avg"]  = df_filled["salary_hour_avg"].fillna(median_hourly)

In [22]:
df_filled.loc[:, "salary_year_avg":"salary_hour_avg"]

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

Dropping duplicates

In [25]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

In [26]:
print(f"Length of original df: \t{len(df_filled)}")
print(f"Length of the drop duplicate df: \t{len(df_unique)}")
print(f"Rows dropped: \t{len(df_filled) - len(df_unique)} ")

Length of original df: 	785741
Length of the drop duplicate df: 	785640
Rows dropped: 	101